x = int(input("輸入X座標:"))
y = int(input("輸入Y座標:"))
if (x>0 and y>0):
    print("該點位於第一象限，","離原點距離為根號",(x)**2+(y)**2)
elif (x<0 and y>0):
    print("該點位於第二象限，","離原點距離為根號",(x)**2+(y)**2)
elif (x<0 and y<0):
    print("該點位於第三象限，","離原點距離為根號",(x)**2+(y)**2)
elif (x>0 and y<0):
    print("該點位於第四象限，","離原點距離為根號",(x)**2+(y)**2)
elif (x==0 and y==0):
    print("該點為原點，","離原點距離為0")

elif (x<0 or x>0 and y==0):
    print("該點位左半平面X軸上，","離原點距離為根號",(x)**2+(y)**2)
elif (x<0 or x>0 and y==0):
    print("該點位右半平面X軸上，","離原點距離為根號",(x)**2+(y)**2)

elif (x==0 and y>0 ):
    print("該點位上半平面Y軸上，","離原點距離為根號",(x)**2+(y)**2)
elif (x==0 and y<0 ):
    print("該點位下半平面Y軸上，","離原點距離為根號",(x)**2+(y)**2)

