f = input("請輸入欲租借的書籍:")
A = {"飢餓遊戲三":"在書架A的第1本","解憂雜貨店":"在書架A的第2本","怪獸與他們的產地":"在書架A的第3本","哈利波特6":"在書架A的第4本","我的阿富汗筆友":"在書架A的第5本","祈念之樹":"在書架A的第6本","樓下的房客":"在書架A的第7本","小王子":"在書架A的第8本"}
B = {"房思琪的初戀樂園":"在書架B的第1本","等一個人咖啡":"在書架B的第2本","鬼滅之刃14":"在書架B的第3本","神農嘗百草":"在書架B的第4本","麥田捕手":"在書架B的第5本","老人與海":"在書架B的第6本","傲慢與偏見":"在書架B的第7本","與神同行":"在書架B的第8本"}
if f in A: 
    if  f == "飢餓遊戲三":
        print(A["飢餓遊戲三"])
    else:
        if f == "解憂雜貨店":
            print(A["解憂雜貨店"])
        else:
            if f == "怪獸與他們的產地":
                print(A["怪獸與他們的產地"])
            else:
                if f == "哈利波特6":
                    print(A["哈利波特6"])
                else:
                    if f == "我的阿富汗筆友":
                        print(A["我的阿富汗筆友"])
                    else:
                        if f == "祈念之樹":
                            print(A["祈念之樹"])
                        else:
                            if f == "樓下的房客":
                                print(A["樓下的房客"])
                            else:
                                if f == "小王子":
                                    print(A["小王子"])
elif f in B:
    if  f == "房思琪的初戀樂園":
        print(B["房思琪的初戀樂園"])
    else:
        if f == "等一個人咖啡":
            print(B["等一個人咖啡"])
        else:
            if f == "鬼滅之刃14":
                print(B["鬼滅之刃14"])      
            else:
                if  f == "神農嘗百草":
                    print(B["神農嘗百草"])
                else:
                    if  f == "麥田捕手":
                        print(B["麥田捕手"])
                    else:
                        if  f == "老人與海":
                            print(B["老人與海"])
                        else:
                            if  f == "傲慢與偏見":
                                print(B["傲慢與偏見"])
                            else:
                                if  f == "與神同行":
                                    print(B["與神同行"])
else:
    print("查無此書籍")

